<?php
class Mosaic_ApiError{
	public $system_errors = null;

	function __construct(){
		$this->system_errors = $this->system_errors();
	}

	public function system_errors(){
		return array(
			10001 => '无效的client_id或client_secret',
			10002 => '无效的签名',
			10003 => '账号不存在',
			10004 => '缺少必须的参数',
			10005 => '账号已经被创建',			
			10006 => '缺少access_token',
			10007 => '无效的access_token',
			10008 => '设备已被封禁',
			10009 => '手机号或密码为空',
			10010 => '此手机号已被使用',
			10011 => '生成access_token失败',
			10012 => '密码错误',
			10013 => '更新登录信息失败',
			10014 => '手机号码不能为空',
			10015 => '密码不能为空',
			10016 => '昵称不能为空',
			10017 => '性别为必选项',
			10018 => '未知的排序类型',
			10019 => '缺少地理位置信息',
			10020 => '评论内容不能为空',
			10021 => '评论内容过长',
			10022 => '你已被对方拉黑',
			10023 => '照片不存在',
			10024 => '已经拉黑对方',
			10025 => '已经举报过，请重复举报',
			10026 => '密码长度不对，合适的密码为6～16位',
			10027 => '发布照片失败',
			10028 => '只有照片的发布者有权进行此操作',
			10028 => '订单验证失败',
			10029 => '订单已经充值过',
			10030 => '不需要解锁',
			10031 => '余额不足',
			10032 => '无效的兑换请求',
			10033 => '已超过最大发送次数限制',
			10034 => '每分钟只能发送1次',
			10035 => '性别已经修改过一次，无法再次修改',
			10036 => '只能将自己的照片设为头像',
			10037 => '只能将公开相册中的照片设为头像',
			10038 => '照片不存在',
			10039 => '只能删除自己的照片',
			10040 => '不能删除头像，请先将其他照片设为头像再尝试',
			10041 => '为了避免造成骚扰，您3分钟之内只能打招呼1次',
			10042 => '普通用户每天最多打招呼3次',
			10043 => '验证码不正确',
			10044 => '手机号码长度不对',
			10045 => '身份证号长度不对',
			10046 => '没有权限登录后台管理端，请联系管理员开通',
			10047 => '你的手机不在员工列表中，请联系管理员创建账号',
			10048 => '你还没有注册账号，请先注册',




			30001 => '已经申请过了，请耐心等待对方回复。',
			30002 => '你已经申请过了，3小时之内无法再次申请,请等待。',
			30003 => '对方并没有申请好友，无法接受好友请求',
			30004 => '已接受对方申请，请不要重复操作。',
			30004 => '已拒绝对方申请，请不要重复操作。',
			30005 => '对方不是你的好友。',
			30006 => '你不是会员，无法查看对方的私密照。',
			30007 => '您不是会员，没有权限申请密友。',
			30008 => '无法对自己进行此项操作',
			30009 => '为了避免造成骚扰，您3分钟之内只能发起1次好友请求',
			30010 => '普通用户每天最多只能发出3次好友请求',

			40001 => '约会不存在',
			40002 => '不能对自己的约会执行此项操作',
			40003 => '你已经对此约会感兴趣过了',
			40004 => '对方对性别有要求，您不满足，无法进行此项操作',
			40005 => '不能删除别人的约会',

			50000 => '完善资料后才可以领取VIP会员',
			50001 => '你已经是VIP会员了，无法领取，请在有效期之后再领取',
			50002 => '您剩余可领取VIP会员天数为0，完善资料后可获得领取天数',
			50003 => '您没有可领取的VIP会员天数',
			50004 => '未达到领取条件',
			50005 => '已经领取过了',

			60001 => '查询次数不足，请充值或者录入黑名单以增加查询次数',
			60002 => '请勿重复投交黑名单资料',
			60003 => '已添加此业务员,请勿重复添加',
			60004 => '导入的数据异常',

			70001 => '未找到商家信息'


			);
	}
}
?>